tap "cloudflare/cloudflare"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "teamookla/speedtest"
# Plugin manager for zsh, inspired by oh-my-zsh and vundle
brew "antigen"
# Command-line tool for Amazon Route 53
brew "cli53"
# Tool that bootstraps your dotfiles
brew "dotbot"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Platform built on V8 to build network applications
brew "node"
# Tool for managing your YubiKey configuration
brew "ykman"
# Command-line tool for the YubiKey PIV application
brew "yubico-piv-tool"
# Cloudflare Tunnel
brew "cloudflare/cloudflare/cloudflared"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Online collaborative whiteboard platform
cask "miro"
# App to write, plan, collaborate, and get organized
cask "notion"
# Instant messaging application focusing on security
cask "signal"
# Open-source code editor
cask "visual-studio-code"
